Revit 2027 API
CancellationListener.IsCancelled Method
 Returns true if the operation associated with this instance has been cancelled.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCancelled()
Public Function IsCancelled As Boolean
public:
bool IsCancelled()
member IsCancelled : unit -> bool
Return Value
Boolean
See Also
Reference
CancellationListener Class
Autodesk.Revit.DB Namespace